#+title: Plan


* Lets deploy this with terraform in a low cost manner
:LOGBOOK:
CLOCK: [2025-09-11 Thu 12:36]
CLOCK: [2025-09-11 Thu 12:02]--[2025-09-11 Thu 12:29] =>  0:27
CLOCK: [2025-09-11 Thu 11:28]--[2025-09-11 Thu 11:38] =>  0:10
CLOCK: [2025-09-11 Thu 11:26]--[2025-09-11 Thu 11:27] =>  0:01
CLOCK: [2025-09-11 Thu 10:48]--[2025-09-11 Thu 11:18] =>  0:30
CLOCK: [2025-09-11 Thu 10:40]--[2025-09-11 Thu 10:48] =>  0:08
:END:
- create a docker container in order to make it reprocuble the installation
- create a server
- install git and docker
- start docker deamon
- clone the clojure web repo
- enter ip + port

** docker  is server is exiting on aws
-
* Let us create a webapp, that outputs "Test"
:LOGBOOK:
CLOCK: [2025-09-11 Thu 08:27]--[2025-09-11 Thu 09:10] =>  0:43
CLOCK: [2025-09-10 Wed 21:45]--[2025-09-10 Wed 21:47] =>  0:02
:END:
** let us use ring + reitit for that
* Push to git
:LOGBOOK:
CLOCK: [2025-09-10 Wed 19:53]--[2025-09-10 Wed 20:02] =>  0:09
:END:
* Output Hello World in the CLI -> it was "Test", that was outputted, but who cares
:LOGBOOK:
CLOCK: [2025-09-10 Wed 14:49]--[2025-09-10 Wed 15:12] =>  0:23
:END:
